Terraform plan in __terraform__
<details>
<summary>Plan: 1 to add, 5 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.gmail_notifier_initWatch_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_initWatch_function" {
      ~ environment_variables = {
          + "FUNCTION_REGION" = "europe-west1"
          + "GCP_PROJECT"     = "lilaobot"
          + "TOPIC_ID"        = "***************"
        }
        id                    = "projects/lilaobot/locations/europe-west1/functions/initWatch"
        name                  = "initWatch"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#8f031effcc7191014dc29c74a8a93713"
        # (13 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_oauth2callback_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2callback_function" {
      ~ environment_variables = {
          + "FUNCTION_REGION" = "europe-west1"
          + "GCP_PROJECT"     = "lilaobot"
          + "TOPIC_ID"        = "***************"
        }
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2callback"
        name                  = "oauth2callback"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#8f031effcc7191014dc29c74a8a93713"
        # (13 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_oauth2init_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2init_function" {
      ~ environment_variables = {
          + "FUNCTION_REGION" = "europe-west1"
          + "GCP_PROJECT"     = "lilaobot"
          + "TOPIC_ID"        = "***************"
        }
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2init"
        name                  = "oauth2init"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#8f031effcc7191014dc29c74a8a93713"
        # (13 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_onNewMessage_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_onNewMessage_function" {
      ~ environment_variables = {
          + "FUNCTION_REGION" = "europe-west1"
          + "GCP_PROJECT"     = "lilaobot"
          + "TOPIC_ID"        = "***************"
        }
        id                    = "projects/lilaobot/locations/europe-west1/functions/onNewMessage"
        name                  = "onNewMessage"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#8f031effcc7191014dc29c74a8a93713"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.slack_publisher_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "slack_publisher_function" {
      ~ environment_variables = {
          + "FUNCTION_REGION" = "europe-west1"
          + "GCP_PROJECT"     = "lilaobot"
          + "TOPIC_ID"        = "***************"
        }
        id                    = "projects/lilaobot/locations/europe-west1/functions/slack-publisher"
        name                  = "slack-publisher"
      ~ source_archive_object = "slack_publisher.zip" -> "slack_publisher.zip#440c12a9d5803e4259fc5e6f5693fbc7"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.gmail_notifier_archive_bucket_object must be replaced
-/+ resource "google_storage_bucket_object" "gmail_notifier_archive_bucket_object" {
      ~ content_type   = "application/zip" -> (known after apply)
      ~ crc32c         = "3nJnTg==" -> (known after apply)
      ~ detect_md5hash = "JY5aGPuYb5gef1I0v09Tpg==" -> "different hash" # forces replacement
      ~ id             = "******************************************************************************" -> (known after apply)
      ~ md5hash        = "JY5aGPuYb5gef1I0v09Tpg==" -> (known after apply)
      ~ name           = "gmail_notifier.zip#258e5a18fb986f981e7f5234bf4f53a6" -> "gmail_notifier.zip#8f031effcc7191014dc29c74a8a93713" # forces replacement
      ~ output_name    = "gmail_notifier.zip#258e5a18fb986f981e7f5234bf4f53a6" -> (known after apply)
      ~ self_link      = "https://www.googleapis.com/storage/v1/b/lilaobot-functions-storage/o/gmail_notifier.zip%23258e5a18fb986f981e7f5234bf4f53a6" -> (known after apply)
      ~ storage_class  = "STANDARD" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #49](https://github.com/Zenika/lilaobot/actions/runs/1585269891)